code/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug" dumptraffic="protocol">
    <clients>
         <client host="localhost" use_controller_vm="true"></client>
    </clients>
    <servers>
        <server host="api.spilgames.com" port="443" type="ssl"></server>
    </servers>
    <load>
        <arrivalphase phase="1" duration="600" unit="second">
            <users arrivalrate="100" unit="second"></users>
        </arrivalphase>
        <arrivalphase phase="2" duration="600" unit="second">
            <users arrivalrate="500" unit="second"></users>
        </load>
    <sessions>
    <session name="api" probability="100" type="ts_http">
			<request>
			    <dyn_variable name="guesttoken" jsonpath="auth.token" />
                <http url='/account/getToken/' version='1.1' contents=
                    '{&quot;type&quot;:&quot;sample&quot;}' content_type='text/json' method='POST'>
                </http>
			</request>
	    </session>
    </sessions>
</tsung>